jobs/20260727-112315-luqia-vllm-nogate-kv-saturation-stress/slurm-250161.out

===== scheduler_sweep_with_saturation_gate =====
workload_source=Dual_Sweep_LLM_Phase2_common_measured_grid
slo_ttft_ms=500 slo_tpot_ms=200 saturation_threshold=0.30
saturation_model=five_seed_mean_local_retrained_75
placement=l40s-prefill-l4-decode
overload_action=min-slo-violation
online_scheduling=true max_l4_freq=none max_l40s_freq=2520
kv_effective_bandwidth_gbps=24.076 kv_num_layers=32 kv_num_heads=8 kv_head_dim=128 kv_bytes_per_element=2 dispatch_ms=0
clock_mismatch_action=continue clock_ack_mode=monitor clock_ack_transport=http_with_file_fallback
scheduler_enabled=true active_scheduler_policy=latency_only gpu_clock_control_mode=manual policy_label=gate_off_kv_saturation_stress
scheduler_workload seq=1 id=threshold_long_prompt il=1024 ol=128 rate=1 online=true active_policy=latency_only
scheduler_selected seq=1 policy=latency_only status=OK prefill=neptune:1245 decode=ganymede:2040 predicted_cluster_power_w=258.3

===== allocation =====
time=2026-07-27T11:24:46+02:00
batch_host=ganymede
SLURM_JOB_ID=250161
SLURM_JOB_NODELIST=ganymede,neptune
model=mistralai/Mistral-7B-v0.1 workload_count=7 slurm_time_limit=00:28:00
ganymede
neptune
JobId=250161 JobName=20260727-112315-luqia-vllm-nogate-kv-saturation-stress
   UserId=chjing(10271) GroupId=root(0) MCS_label=N/A
   Priority=1 Nice=0 Account=student QOS=normal
   JobState=RUNNING Reason=None Dependency=(null)
   Requeue=1 Restarts=0 BatchFlag=1 Reboot=0 ExitCode=0:0
   RunTime=00:00:01 TimeLimit=01:00:00 TimeMin=N/A
   SubmitTime=2026-07-27T11:24:45 EligibleTime=2026-07-27T11:24:45
   AccrueTime=2026-07-27T11:24:45
   StartTime=2026-07-27T11:24:45 EndTime=2026-07-27T12:24:45 Deadline=N/A
   SuspendTime=None SecsPreSuspend=0 LastSchedEval=2026-07-27T11:24:45 Scheduler=Backfill
   Partition=long AllocNode:Sid=minerva:919086
   ReqNodeList=ganymede,neptune ExcNodeList=(null)
   NodeList=ganymede,neptune
   BatchHost=ganymede
   NumNodes=2 NumCPUs=256 NumTasks=2 CPUs/Task=16 ReqB:S:C:T=0:0:*:*
   ReqTRES=cpu=16,mem=128G,node=2,billing=16,gres/gpu=2
   AllocTRES=cpu=256,mem=128G,node=2,billing=256,gres/gpu=4,gres/gpu:l4=8,gres/gpu:l40s=4
   Socks/Node=* NtasksPerN:B:S:C=1:0:*:* CoreSpec=*
   MinCPUsNode=16 MinMemoryNode=64G MinTmpDiskNode=0
   Features=(null) DelayBoot=00:00:00
   OverSubscribe=NO Contiguous=0 Licenses=(null) Network=(null)
   Command=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260727-112315-luqia-vllm-nogate-kv-saturation-stress/run.sbatch
   WorkDir=/data/users/chjing/Sweep_LLM_Jobs_broker
   StdErr=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260727-112315-luqia-vllm-nogate-kv-saturation-stress/slurm-250161.err
   StdIn=/dev/null
   StdOut=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260727-112315-luqia-vllm-nogate-kv-saturation-stress/slurm-250161.out
   Power=
   TresPerNode=gres/gpu:1
   TresPerTask=cpu:8
   


===== 100gbe_and_environment_preflight =====
[NVGPUFREQ][INFO] The spank nvgpufreq plugin has been loaded!
[NVGPUFREQ][ERROR] Failed to retrive the job ID from slurmctld! Exit!
host=ganymede node_group=ganymede role=decode mode=preflight
scheduled_gpu=l4 scheduled_freq_mhz=2040 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.3 peer_ip=10.1.0.6 interface=eno12399np0
host=neptune node_group=neptune role=prefill mode=preflight
scheduled_gpu=l40s scheduled_freq_mhz=1245 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.6 peer_ip=10.1.0.3 interface=enp160s0f0np0
CUDA_VISIBLE_DEVICES=0
CUDA_VISIBLE_DEVICES=0
eno12399np0      UP             10.1.0.3/16 fe80::632:1ff:fe4d:80/64 
10.1.0.6 dev eno12399np0 src 10.1.0.3 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
enp160s0f0np0    UP             10.1.0.6/16 fe80::6e92:cfff:fe5e:cc00/64 
10.1.0.3 dev enp160s0f0np0 src 10.1.0.6 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
index, name, memory.total [MiB], driver_version
0, NVIDIA L4, 23034 MiB, 595.71.05
1, NVIDIA L4, 23034 MiB, 595.71.05
2, NVIDIA L4, 23034 MiB, 595.71.05
3, NVIDIA L4, 23034 MiB, 595.71.05
4, NVIDIA L4, 23034 MiB, 595.71.05
5, NVIDIA L4, 23034 MiB, 595.71.05
6, NVIDIA L4, 23034 MiB, 595.71.05
7, NVIDIA L4, 23034 MiB, 595.71.05
index, name, memory.total [MiB], driver_version
0, NVIDIA L40S, 46068 MiB, 595.71.05
1, NVIDIA L40S, 46068 MiB, 595.71.05
2, NVIDIA L40S, 46068 MiB, 595.71.05
3, NVIDIA L40S, 46068 MiB, 595.71.05
host=ganymede import=torch version=2.9.1+cu128
host=ganymede import=vllm version=0.15.1
host=ganymede import=aiohttp version=3.13.3
host=ganymede import=msgpack version=1.1.2
host=ganymede import=zmq version=27.1.0
host=neptune import=torch version=2.9.1+cu128
host=neptune import=vllm version=0.15.1
host=neptune import=aiohttp version=3.13.3
host=neptune import=msgpack version=1.1.2
host=neptune import=zmq version=27.1.0
preflight_rc=0

===== start_proxy =====
proxy_pid=1970055
waiting name=proxy elapsed_s=5 url=http://127.0.0.1:30161/health
ready name=proxy elapsed_s=5 url=http://127.0.0.1:30161/health

===== start_prefill_and_decode_once =====
server_step_pid=1970083
waiting name=prefill elapsed_s=5 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=10 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=15 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=20 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=25 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=30 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=35 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=40 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=45 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=50 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=55 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=60 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=65 url=http://10.1.0.6:32161/v1/models
waiting name=prefill elapsed_s=70 url=http://10.1.0.6:32161/v1/models
ready name=prefill elapsed_s=70 url=http://10.1.0.6:32161/v1/models
ready name=decode elapsed_s=0 url=http://10.1.0.3:33161/v1/models

===== wait_for_pd_registry =====
{"prefill": ["10.1.0.6:32161"], "decode": ["10.1.0.3:33161"]}
registry_ready=true

===== pd_smoke_request =====
smoke_curl_rc=0
vllm_burstiness_supported=true

===== multi_workload_bench =====

===== workload_1_threshold_long_prompt =====
workload_start time=2026-07-27T11:26:11+02:00 seq=1 id=threshold_long_prompt il=1024 ol=128 request_rate=1 window_seconds=12 burstiness=1.0 description=proven_latency_safe_capacity_saturation
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=1245 ganymede_decode_mhz=2040 predicted_cluster_power_w=258.3
clock_request seq=1 neptune_mhz=1245 ganymede_mhz=2040
clock_ack seq=1 node_group=neptune target_mhz=1245 rc=0 observed_mhz=1245 verification_mode=monitor transport=http
clock_ack seq=1 node_group=ganymede target_mhz=2040 rc=0 observed_mhz=2040 verification_mode=monitor transport=http
bench_config num_prompts=12 nominal_window_s=12 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785144432.032220000 event=workload_start seq=1 workload_id=threshold_long_prompt
energy_event unix_ts=1785144482.451798519 event=workload_end seq=1 workload_id=threshold_long_prompt
bench_rc=0 seq=1 id=threshold_long_prompt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x798ff2ccd120>, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30161', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-3297956e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-27 11:27:34 [datasets.py:612] Sampling input_len from [1023, 1023] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:07<00:00,  7.54s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 12/12 [00:20<00:00,  1.67s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  20.06     
Total input tokens:                      12276     
Total generated tokens:                  1536      
Request throughput (req/s):              0.60      
Output token throughput (tok/s):         76.58     
Peak output token throughput (tok/s):    120.00    
Peak concurrent requests:                9.00      
Total token throughput (tok/s):          688.59    
---------------Time to First Token----------------
Mean TTFT (ms):                          324.97    
Median TTFT (ms):                        330.71    
P99 TTFT (ms):                           368.73    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.60     
Median TPOT (ms):                        62.89     
P99 TPOT (ms):                           63.54     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.60     
Median ITL (ms):                         62.79     
P99 ITL (ms):                            72.12     
==================================================
bench_request_counts seq=1 id=threshold_long_prompt successful=12 failed=0

===== online_scheduler_window_2_long_decode =====
scheduler_workload seq=2 id=long_decode il=512 ol=1024 rate=1 online=true active_policy=latency_only
scheduler_selected seq=2 policy=latency_only status=OK prefill=neptune:735 decode=ganymede:2040 predicted_cluster_power_w=256.8

===== workload_2_long_decode =====
workload_start time=2026-07-27T11:28:03+02:00 seq=2 id=long_decode il=512 ol=1024 request_rate=1 window_seconds=12 burstiness=1.0 description=proven_long_decode_capacity_saturation
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=735 ganymede_decode_mhz=2040 predicted_cluster_power_w=256.8
clock_request seq=2 neptune_mhz=735 ganymede_mhz=2040
clock_ack seq=2 node_group=neptune target_mhz=735 rc=0 observed_mhz=1245 verification_mode=monitor transport=http
clock_ack seq=2 node_group=ganymede target_mhz=2040 rc=0 observed_mhz=2040 verification_mode=monitor transport=http
bench_config num_prompts=12 nominal_window_s=12 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785144484.346735973 event=workload_start seq=2 workload_id=long_decode
energy_event unix_ts=1785144638.539190213 event=workload_end seq=2 workload_id=long_decode
bench_rc=0 seq=2 id=long_decode
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fd3e45e5120>, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30161', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-fab0c64c-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-27 11:28:18 [datasets.py:612] Sampling input_len from [511, 511] and output_len from [1024, 1024]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:58<00:00, 58.58s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 12/12 [01:20<00:00,  6.73s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  80.75     
Total input tokens:                      6132      
Total generated tokens:                  12288     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         152.17    
Peak output token throughput (tok/s):    192.00    
Peak concurrent requests:                12.00     
Total token throughput (tok/s):          228.11    
---------------Time to First Token----------------
Mean TTFT (ms):                          272.49    
Median TTFT (ms):                        270.82    
P99 TTFT (ms):                           314.56    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          66.81     
Median TPOT (ms):                        66.89     
P99 TPOT (ms):                           67.01     
---------------Inter-token Latency----------------
Mean ITL (ms):                           66.81     
Median ITL (ms):                         67.04     
P99 ITL (ms):                            71.27     
==================================================
bench_request_counts seq=2 id=long_decode successful=12 failed=0

===== online_scheduler_window_3_moderate_balanced =====
scheduler_workload seq=3 id=moderate_balanced il=128 ol=128 rate=5 online=true active_policy=latency_only
scheduler_selected seq=3 policy=latency_only status=OK prefill=neptune:480 decode=ganymede:1200 predicted_cluster_power_w=208.1

===== workload_3_moderate_balanced =====
workload_start time=2026-07-27T11:30:39+02:00 seq=3 id=moderate_balanced il=128 ol=128 request_rate=5 window_seconds=10 burstiness=1.0 description=proven_balanced_capacity_saturation
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=480 ganymede_decode_mhz=1200 predicted_cluster_power_w=208.1
clock_request seq=3 neptune_mhz=480 ganymede_mhz=1200
clock_ack seq=3 node_group=neptune target_mhz=480 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=3 node_group=ganymede target_mhz=1200 rc=0 observed_mhz=2040 verification_mode=monitor transport=http
bench_config num_prompts=50 nominal_window_s=10 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785144640.340982623 event=workload_start seq=3 workload_id=moderate_balanced
energy_event unix_ts=1785144699.674161184 event=workload_end seq=3 workload_id=moderate_balanced
bench_rc=0 seq=3 id=moderate_balanced
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7bb2f75e9120>, seed=0, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30161', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-210fbaac-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-27 11:30:58 [datasets.py:612] Sampling input_len from [127, 127] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:07<00:00,  7.36s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 50/50 [00:32<00:00,  1.52it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  32.91     
Total input tokens:                      6350      
Total generated tokens:                  6400      
Request throughput (req/s):              1.52      
Output token throughput (tok/s):         194.46    
Peak output token throughput (tok/s):    256.00    
Peak concurrent requests:                21.00     
Total token throughput (tok/s):          387.40    
---------------Time to First Token----------------
Mean TTFT (ms):                          270.15    
Median TTFT (ms):                        251.51    
P99 TTFT (ms):                           379.22    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.72     
Median TPOT (ms):                        63.00     
P99 TPOT (ms):                           63.10     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.72     
Median ITL (ms):                         62.86     
P99 ITL (ms):                            74.19     
==================================================
bench_request_counts seq=3 id=moderate_balanced successful=50 failed=0

===== online_scheduler_window_4_extreme_short_rps =====
scheduler_workload seq=4 id=extreme_short_rps il=2 ol=64 rate=50 online=true active_policy=latency_only
scheduler_selected seq=4 policy=latency_only status=OK prefill=neptune:1755 decode=ganymede:990 predicted_cluster_power_w=181.3

===== workload_4_extreme_short_rps =====
workload_start time=2026-07-27T11:31:40+02:00 seq=4 id=extreme_short_rps il=2 ol=64 request_rate=50 window_seconds=10 burstiness=1.0 description=proven_extreme_request_rate_saturation
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=1755 ganymede_decode_mhz=990 predicted_cluster_power_w=181.3
clock_request seq=4 neptune_mhz=1755 ganymede_mhz=990
clock_ack seq=4 node_group=neptune target_mhz=1755 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=4 node_group=ganymede target_mhz=990 rc=0 observed_mhz=1200 verification_mode=monitor transport=http
bench_config num_prompts=500 nominal_window_s=10 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785144701.411114588 event=workload_start seq=4 workload_id=extreme_short_rps
energy_event unix_ts=1785144865.664647584 event=workload_end seq=4 workload_id=extreme_short_rps
bench_rc=0 seq=4 id=extreme_short_rps
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7082d6915120>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=2, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30161', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=50.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-40a97b30-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-27 11:31:54 [datasets.py:612] Sampling input_len from [1, 1] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:03<00:00,  3.75s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 50.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 500/500 [02:26<00:00,  3.41it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           50.00     
Benchmark duration (s):                  146.68    
Total input tokens:                      500       
Total generated tokens:                  32000     
Request throughput (req/s):              3.41      
Output token throughput (tok/s):         218.16    
Peak output token throughput (tok/s):    272.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          221.57    
---------------Time to First Token----------------
Mean TTFT (ms):                          669.65    
Median TTFT (ms):                        781.77    
P99 TTFT (ms):                           912.58    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.27     
Median TPOT (ms):                        62.34     
P99 TPOT (ms):                           62.50     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.27     
Median ITL (ms):                         62.26     
P99 ITL (ms):                            71.64     
==================================================
bench_request_counts seq=4 id=extreme_short_rps successful=500 failed=0

===== online_scheduler_window_5_long_prompt_high_rate =====
scheduler_workload seq=5 id=long_prompt_high_rate il=1024 ol=128 rate=5 online=true active_policy=latency_only
overload_fallback_selected seq=5 id=long_prompt_high_rate policy=latency_only predicted_violation_probability=0.990604
scheduler_selected seq=5 policy=latency_only status=OVERLOAD_FALLBACK prefill=neptune:2520 decode=ganymede:2040 predicted_cluster_power_w=332.0

===== workload_5_long_prompt_high_rate =====
workload_start time=2026-07-27T11:34:26+02:00 seq=5 id=long_prompt_high_rate il=1024 ol=128 request_rate=5 window_seconds=10 burstiness=1.0 description=long_prompt_rate_stress
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=2520 ganymede_decode_mhz=2040 predicted_cluster_power_w=332.0
clock_request seq=5 neptune_mhz=2520 ganymede_mhz=2040
clock_ack seq=5 node_group=neptune target_mhz=2520 rc=0 observed_mhz=1755 verification_mode=monitor transport=http
clock_ack seq=5 node_group=ganymede target_mhz=2040 rc=0 observed_mhz=2040 verification_mode=monitor transport=http
bench_config num_prompts=50 nominal_window_s=10 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785144867.571829956 event=workload_start seq=5 workload_id=long_prompt_high_rate